http.request.header.accept=Accept\u8bf7\u6c42\u5934\u7528\u6765\u544a\u77e5\u5ba2\u6237\u7aef\u53ef\u4ee5\u5904\u7406\u7684\u5185\u5bb9\u7c7b\u578b\uff0c\u8fd9\u79cd\u5185\u5bb9\u7c7b\u578b\u7528MIME\u7c7b\u578b\u6765\u8868\u793a\u3002\u501f\u52a9\u5185\u5bb9\u534f\u5546\u673a\u5236\uff0c\u670d\u52a1\u5668\u53ef\u4ee5\u4ece\u8bf8\u591a\u5907\u9009\u9879\u4e2d\u9009\u62e9\u4e00\u9879\u8fdb\u884c\u5e94\u7528\uff0c\u5e76\u4f7f\u7528Content-Type\u5e94\u7b54\u5934\u901a\u77e5\u5ba2\u6237\u7aef\u5b83\u7684\u9009\u62e9\u3002\u6d4f\u89c8\u5668\u4f1a\u57fa\u4e8e\u8bf7\u6c42\u7684\u4e0a\u4e0b\u6587\u6765\u4e3a\u8fd9\u4e2a\u8bf7\u6c42\u5934\u8bbe\u7f6e\u5408\u9002\u7684\u503c\uff0c\u6bd4\u5982\u83b7\u53d6\u4e00\u4e2aCSS\u5c42\u53e0\u6837\u5f0f\u8868\u65f6\u503c\u4e0e\u83b7\u53d6\u56fe\u7247\u3001\u89c6\u9891\u6216\u811a\u672c\u6587\u4ef6\u65f6\u7684\u503c\u662f\u4e0d\u540c\u7684\u3002
http.request.header.accept-charset=Accept-Charset\u8bf7\u6c42\u5934\u7528\u6765\u544a\u77e5\uff08\u670d\u52a1\u5668\uff09\u5ba2\u6237\u7aef\u53ef\u4ee5\u5904\u7406\u7684\u5b57\u7b26\u96c6\u7c7b\u578b\u3002\u501f\u52a9\u5185\u5bb9\u534f\u5546\u673a\u5236\uff0c\u670d\u52a1\u5668\u53ef\u4ee5\u4ece\u8bf8\u591a\u5907\u9009\u9879\u4e2d\u9009\u62e9\u4e00\u9879\u8fdb\u884c\u5e94\u7528\uff0c\u5e76\u4f7f\u7528Content-Type\u5e94\u7b54\u5934\u901a\u77e5\u5ba2\u6237\u7aef\u5b83\u7684\u9009\u62e9\u3002\u6d4f\u89c8\u5668\u901a\u5e38\u4e0d\u4f1a\u8bbe\u7f6e\u6b64\u9879\u503c\uff0c\u56e0\u4e3a\u6bcf\u79cd\u5185\u5bb9\u7c7b\u578b\u7684\u9ed8\u8ba4\u503c\u901a\u5e38\u90fd\u662f\u6b63\u786e\u7684\uff0c\u4f46\u662f\u53d1\u9001\u5b83\u4f1a\u66f4\u6709\u5229\u4e8e\u8bc6\u522b\u3002
http.request.header.accept-encoding=Accept-Encoding\u8bf7\u6c42\u5934\u4f1a\u5c06\u5ba2\u6237\u7aef\u80fd\u591f\u7406\u89e3\u7684\u5185\u5bb9\u7f16\u7801\u65b9\u5f0f\u2014\u2014\u901a\u5e38\u662f\u67d0\u79cd\u538b\u7f29\u7b97\u6cd5\u2014\u2014\u8fdb\u884c\u901a\u77e5\u3002\u901a\u8fc7\u5185\u5bb9\u534f\u5546\u7684\u65b9\u5f0f\uff0c\u670d\u52a1\u7aef\u4f1a\u9009\u62e9\u4e00\u4e2a\u5ba2\u6237\u7aef\u63d0\u8bae\u7684\u65b9\u5f0f\uff0c\u4f7f\u7528\u5e76\u5728\u54cd\u5e94\u62a5\u6587\u9996\u90e8Content-Encoding\u4e2d\u901a\u77e5\u5ba2\u6237\u7aef\u8be5\u9009\u62e9\u3002 
http.request.header.accept-language=Accept-Language\u8bf7\u6c42\u5934\u5141\u8bb8\u5ba2\u6237\u7aef\u58f0\u660e\u5b83\u53ef\u4ee5\u7406\u89e3\u7684\u81ea\u7136\u8bed\u8a00\uff0c\u4ee5\u53ca\u4f18\u5148\u9009\u62e9\u7684\u533a\u57df\u65b9\u8a00\u3002\u501f\u52a9\u5185\u5bb9\u534f\u5546\u673a\u5236\uff0c\u670d\u52a1\u5668\u53ef\u4ee5\u4ece\u8bf8\u591a\u5907\u9009\u9879\u4e2d\u9009\u62e9\u4e00\u9879\u8fdb\u884c\u5e94\u7528\uff0c\u5e76\u4f7f\u7528Content-Language \u5e94\u7b54\u5934\u901a\u77e5\u5ba2\u6237\u7aef\u5b83\u7684\u9009\u62e9\u3002\u6d4f\u89c8\u5668\u4f1a\u57fa\u4e8e\u5176\u7528\u6237\u754c\u9762\u8bed\u8a00\u6765\u4e3a\u8fd9\u4e2a\u8bf7\u6c42\u5934\u8bbe\u7f6e\u5408\u9002\u7684\u503c\uff0c\u5373\u4fbf\u662f\u7528\u6237\u53ef\u4ee5\u8fdb\u884c\u4fee\u6539\uff0c\u4f46\u662f\u8fd9\u79cd\u60c5\u51b5\u6781\u5c11\u53d1\u751f\u3002
http.request.header.access-control-request-headers=Access-Control-Request-Headers\u8bf7\u6c42\u5934\u51fa\u73b0\u4e8ePreflight Request\uff08\u9884\u68c0\u8bf7\u6c42\uff09\u4e2d\uff0c\u7528\u4e8e\u901a\u77e5\u670d\u52a1\u5668\u5728\u771f\u6b63\u7684\u8bf7\u6c42\u4e2d\u4f1a\u91c7\u7528\u54ea\u4e9b\u8bf7\u6c42\u5934\u90e8\u3002\u4f8b\u5982\uff1aAccess-Control-Request-Headers: X-PINGOTHER, Content-Type
http.request.header.access-control-request-method= Access-Control-Request-Method \u8bf7\u6c42\u5934\u51fa\u73b0\u4e8ePreflight Request\uff08\u9884\u68c0\u8bf7\u6c42\uff09\u4e2d\uff0c\u7528\u4e8e\u901a\u77e5\u670d\u52a1\u5668\u5728\u771f\u6b63\u7684\u8bf7\u6c42\u4e2d\u4f1a\u91c7\u7528\u54ea\u79cdHTTP\u65b9\u6cd5\u3002\u56e0\u4e3a\u9884\u68c0\u8bf7\u6c42\u6240\u4f7f\u7528\u7684\u65b9\u6cd5\u603b\u662fOPTIONS\uff0c\u4e0e\u5b9e\u9645\u8bf7\u6c42\u6240\u4f7f\u7528\u7684\u65b9\u6cd5\u4e0d\u4e00\u6837\uff0c\u6240\u4ee5\u8fd9\u4e2a\u5934\u90e8\u662f\u5fc5\u8981\u7684\u3002
http.request.header.authorization=Authorization\u8bf7\u6c42\u5934\u542b\u6709\u670d\u52a1\u5668\u7528\u4e8e\u9a8c\u8bc1\u7528\u6237\u4ee3\u7406\u8eab\u4efd\u7684\u51ed\u8bc1\uff0c\u901a\u5e38\u4f1a\u5728\u670d\u52a1\u5668\u8fd4\u56de"401 Unauthorized"\u72b6\u6001\u7801\u4ee5\u53caWWW-Authenticate\u6d88\u606f\u5934\u4e4b\u540e\u5728\u540e\u7eed\u8bf7\u6c42\u4e2d\u53d1\u9001\u6b64\u6d88\u606f\u5934\u3002
http.request.header.cookie=Cookie\u662f\u4e00\u4e2a\u8bf7\u6c42\u5934\uff0c\u5176\u4e2d\u542b\u6709\u5148\u524d\u7531\u670d\u52a1\u5668\u901a\u8fc7Set-Cookie\u5934\u6295\u653e\u5e76\u5b58\u50a8\u5230\u5ba2\u6237\u7aef\u7684HTTP cookies\u3002\u8fd9\u4e2a\u5934\u53ef\u80fd\u4f1a\u88ab\u5b8c\u5168\u79fb\u9664\uff0c\u4f8b\u5982\u5728\u6d4f\u89c8\u5668\u7684\u9690\u79c1\u8bbe\u7f6e\u91cc\u9762\u8bbe\u7f6e\u4e3a\u7981\u7528cookie\u3002
http.request.header.cookie2=\u8fd9\u4e2a\u5df2\u7ecf\u88ab\u5e9f\u5f03\u7684Cookie2\u8bf7\u6c42\u5934\u66fe\u7ecf\u88ab\u7528\u6765\u544a\u77e5\u6d4f\u89c8\u5668\u8be5\u7528\u6237\u4ee3\u7406\u652f\u6301\u65b0\u578bcookies\uff0c\u4f46\u662f\u73b0\u4ee3\u7684\u7528\u6237\u4ee3\u7406\u4e00\u822c\u4f7f\u7528Cookie\u6765\u66ff\u4ee3Cookie2\u3002
http.request.header.dnt=DNT(Do Not Track)\u6c42\u5934\u8868\u660e\u4e86\u7528\u6237\u5bf9\u4e8e\u7f51\u7ad9\u8ffd\u8e2a\u7684\u504f\u597d\u3002\u5b83\u5141\u8bb8\u7528\u6237\u6307\u5b9a\u81ea\u5df1\u662f\u5426\u66f4\u6ce8\u91cd\u4e2a\u4eba\u9690\u79c1\u8fd8\u662f\u5b9a\u5236\u5316\u5185\u5bb9\u30020:\u8868\u793a\u7528\u6237\u66f4\u613f\u610f\u5141\u8bb8\u76ee\u6807\u7ad9\u70b9\u5bf9\u4e2a\u4eba\u4fe1\u606f\u8fdb\u884c\u8ffd\u8e2a\u30021:\u8868\u793a\u7528\u6237\u66f4\u613f\u610f\u7981\u6b62\u76ee\u6807\u7ad9\u70b9\u5bf9\u4e2a\u4eba\u4fe1\u606f\u8fdb\u884c\u8ffd\u8e2a\u3002
http.request.header.expect=Expect\u662f\u4e00\u4e2a\u8bf7\u6c42\u6d88\u606f\u5934\uff0c\u5305\u542b\u4e00\u4e2a\u671f\u671b\u6761\u4ef6\uff0c\u8868\u793a\u670d\u52a1\u5668\u53ea\u6709\u5728\u6ee1\u8db3\u6b64\u671f\u671b\u6761\u4ef6\u7684\u60c5\u51b5\u4e0b\u624d\u80fd\u59a5\u5584\u5730\u5904\u7406\u8bf7\u6c42\u3002
http.request.header.forwarded=Forwarded\u8bf7\u6c42\u5934\u4e2d\u5305\u542b\u4e86\u4ee3\u7406\u670d\u52a1\u5668\u9762\u5411\u5ba2\u6237\u7aef\u7684\u4e00\u7aef\uff0c\u7531\u4e8e\u4ee3\u7406\u670d\u52a1\u5668\u7684\u5728\u8bf7\u6c42\u8def\u5f84\u4e2d\u7684\u4ecb\u5165\u800c\u88ab\u4fee\u6539\u6216\u4e22\u5931\u7684\u4fe1\u606f\u3002\u5176\u4ed6\u53ef\u7528\u6765\u66ff\u6362\u7684\uff0c\u5df2\u7ecf\u6210\u4e3a\u65e2\u6210\u6807\u51c6\u7684\u9996\u90e8\u662fX-Forwarded-For\u3001 X-Forwarded-Host\u4ee5\u53caX-Forwarded-Proto\u3002
http.request.header.from=From\u8bf7\u6c42\u5934\u4e2d\u5305\u542b\u4e00\u4e2a\u7535\u5b50\u90ae\u7bb1\u5730\u5740\uff0c\u8fd9\u4e2a\u7535\u5b50\u90ae\u7bb1\u5730\u5740\u5c5e\u4e8e\u53d1\u9001\u8bf7\u6c42\u7684\u7528\u6237\u4ee3\u7406\u7684\u5b9e\u9645\u638c\u63a7\u8005\u7684\u4eba\u7c7b\u7528\u6237\u3002
http.request.header.host=Host\u8bf7\u6c42\u5934\u6307\u660e\u4e86\u670d\u52a1\u5668\u7684\u57df\u540d\uff08\u5bf9\u4e8e\u865a\u62df\u4e3b\u673a\u6765\u8bf4\uff09\uff0c\u4ee5\u53ca\uff08\u53ef\u9009\u7684\uff09\u670d\u52a1\u5668\u76d1\u542c\u7684TCP\u7aef\u53e3\u53f7\u3002\u5982\u679c\u6ca1\u6709\u7ed9\u5b9a\u7aef\u53e3\u53f7\uff0c\u4f1a\u81ea\u52a8\u4f7f\u7528\u88ab\u8bf7\u6c42\u670d\u52a1\u7684\u9ed8\u8ba4\u7aef\u53e3\uff08\u6bd4\u5982\u8bf7\u6c42\u4e00\u4e2aHTTP\u7684URL\u4f1a\u81ea\u52a8\u4f7f\u752880\u7aef\u53e3\uff09\u3002HTTP/1.1 \u7684\u6240\u6709\u8bf7\u6c42\u62a5\u6587\u4e2d\u5fc5\u987b\u5305\u542b\u4e00\u4e2aHost\u5934\u5b57\u6bb5\u3002\u5982\u679c\u4e00\u4e2a HTTP/1.1\u8bf7\u6c42\u7f3a\u5c11 Host\u5934\u5b57\u6bb5\u6216\u8005\u8bbe\u7f6e\u4e86\u8d85\u8fc7\u4e00\u4e2a\u7684 Host\u5934\u5b57\u6bb5\uff0c\u4e00\u4e2a400\uff08Bad Request\uff09\u72b6\u6001\u7801\u4f1a\u88ab\u8fd4\u56de\u3002
http.request.header.if-match=If-Match\u8bf7\u6c42\u5934\u7684\u4f7f\u7528\u8868\u793a\u8fd9\u662f\u4e00\u4e2a\u6761\u4ef6\u8bf7\u6c42\u3002\u5728\u8bf7\u6c42\u65b9\u6cd5\u4e3aGET\u548cHEAD\u7684\u60c5\u51b5\u4e0b\uff0c\u670d\u52a1\u5668\u4ec5\u5728\u8bf7\u6c42\u7684\u8d44\u6e90\u6ee1\u8db3\u6b64\u9996\u90e8\u5217\u51fa\u7684ETag\u4e4b\u4e00\u65f6\u624d\u4f1a\u8fd4\u56de\u8d44\u6e90\u3002\u800c\u5bf9\u4e8ePUT\u6216\u5176\u4ed6\u975e\u5b89\u5168\u65b9\u6cd5\u6765\u8bf4\uff0c\u53ea\u6709\u5728\u6ee1\u8db3\u6761\u4ef6\u7684\u60c5\u51b5\u4e0b\u624d\u53ef\u4ee5\u5c06\u8d44\u6e90\u4e0a\u4f20\u3002
http.request.header.if-modified-since=If-Modified-Since\u662f\u4e00\u4e2a\u6761\u4ef6\u5f0f\u8bf7\u6c42\u5934\uff0c\u670d\u52a1\u5668\u53ea\u5728\u6240\u8bf7\u6c42\u7684\u8d44\u6e90\u5728\u7ed9\u5b9a\u7684\u65e5\u671f\u65f6\u95f4\u4e4b\u540e\u5bf9\u5185\u5bb9\u8fdb\u884c\u8fc7\u4fee\u6539\u7684\u60c5\u51b5\u4e0b\u624d\u4f1a\u5c06\u8d44\u6e90\u8fd4\u56de\uff0c\u72b6\u6001\u7801\u4e3a 200\u3002\u5982\u679c\u8bf7\u6c42\u7684\u8d44\u6e90\u4ece\u90a3\u65f6\u8d77\u672a\u7ecf\u4fee\u6539\uff0c\u90a3\u4e48\u8fd4\u56de\u4e00\u4e2a\u4e0d\u5e26\u6709\u6d88\u606f\u4e3b\u4f53\u7684304\u54cd\u5e94\uff0c\u800c\u5728Last-Modified\u9996\u90e8\u4e2d\u4f1a\u5e26\u6709\u4e0a\u6b21\u4fee\u6539\u65f6\u95f4\u3002\u4e0d\u540c\u4e8eIf-Unmodified-Since\uff0cIf-Modified-Since\u53ea\u53ef\u4ee5\u7528\u5728GET\u6216HEAD\u8bf7\u6c42\u4e2d\u3002\u5f53\u4e0e If-None-Match\u4e00\u540c\u51fa\u73b0\u65f6\uff0c\u5b83\u4f1a\u88ab\u5ffd\u7565\u6389\uff0c\u9664\u975e\u670d\u52a1\u5668\u4e0d\u652f\u6301If-None-Match\u3002\u6700\u5e38\u89c1\u7684\u5e94\u7528\u573a\u666f\u662f\u6765\u66f4\u65b0\u6ca1\u6709\u7279\u5b9aETag\u6807\u7b7e\u7684\u7f13\u5b58\u5b9e\u4f53\u3002
http.request.header.if-none-match=If-None-Match\u662f\u4e00\u4e2a\u6761\u4ef6\u5f0f\u8bf7\u6c42\u5934\u3002\u5bf9\u4e8eGETGET\u548cHEAD\u8bf7\u6c42\u65b9\u6cd5\u6765\u8bf4\uff0c\u5f53\u4e14\u4ec5\u5f53\u670d\u52a1\u5668\u4e0a\u6ca1\u6709\u4efb\u4f55\u8d44\u6e90\u7684ETag\u5c5e\u6027\u503c\u4e0e\u8fd9\u4e2a\u9996\u90e8\u4e2d\u5217\u51fa\u7684\u76f8\u5339\u914d\u7684\u65f6\u5019\uff0c\u670d\u52a1\u5668\u7aef\u4f1a\u624d\u8fd4\u56de\u6240\u8bf7\u6c42\u7684\u8d44\u6e90\uff0c\u54cd\u5e94\u7801\u4e3a200\u3002\u5bf9\u4e8e\u5176\u4ed6\u65b9\u6cd5\u6765\u8bf4\uff0c\u5f53\u4e14\u4ec5\u5f53\u6700\u7ec8\u786e\u8ba4\u6ca1\u6709\u5df2\u5b58\u5728\u7684\u8d44\u6e90\u7684ETag\u5c5e\u6027\u503c\u4e0e\u8fd9\u4e2a\u9996\u90e8\u4e2d\u6240\u5217\u51fa\u7684\u76f8\u5339\u914d\u7684\u65f6\u5019\uff0c\u624d\u4f1a\u5bf9\u8bf7\u6c42\u8fdb\u884c\u76f8\u5e94\u7684\u5904\u7406\u3002
http.request.header.if-range=If-Range HTTP\u8bf7\u6c42\u5934\u5b57\u6bb5\u7528\u6765\u4f7f\u5f97Range\u5934\u5b57\u6bb5\u5728\u4e00\u5b9a\u6761\u4ef6\u4e0b\u8d77\u4f5c\u7528\uff1a\u5f53\u5b57\u6bb5\u503c\u4e2d\u7684\u6761\u4ef6\u5f97\u5230\u6ee1\u8db3\u65f6\uff0cRange\u5934\u5b57\u6bb5\u624d\u4f1a\u8d77\u4f5c\u7528\uff0c\u540c\u65f6\u670d\u52a1\u5668\u56de\u590d206\u90e8\u5206\u5185\u5bb9\u72b6\u6001\u7801\uff0c\u4ee5\u53caRange\u5934\u5b57\u6bb5\u8bf7\u6c42\u7684\u76f8\u5e94\u90e8\u5206\uff1b\u5982\u679c\u5b57\u6bb5\u503c\u4e2d\u7684\u6761\u4ef6\u6ca1\u6709\u5f97\u5230\u6ee1\u8db3\uff0c\u670d\u52a1\u5668\u5c06\u4f1a\u8fd4\u56de"200 OK"\u72b6\u6001\u7801\uff0c\u5e76\u8fd4\u56de\u5b8c\u6574\u7684\u8bf7\u6c42\u8d44\u6e90\u3002
http.request.header.if-unmodified-since=If-Unmodified-Since\u6d88\u606f\u5934\u7528\u4e8e\u8bf7\u6c42\u4e4b\u4e2d\uff0c\u4f7f\u5f97\u5f53\u524d\u8bf7\u6c42\u6210\u4e3a\u6761\u4ef6\u5f0f\u8bf7\u6c42\uff1a\u53ea\u6709\u5f53\u8d44\u6e90\u5728\u6307\u5b9a\u7684\u65f6\u95f4\u4e4b\u540e\u6ca1\u6709\u8fdb\u884c\u8fc7\u4fee\u6539\u7684\u60c5\u51b5\u4e0b\uff0c\u670d\u52a1\u5668\u624d\u4f1a\u8fd4\u56de\u8bf7\u6c42\u7684\u8d44\u6e90\uff0c\u6216\u662f\u63a5\u53d7POST\u6216\u5176\u4ed6non-safe\u65b9\u6cd5\u7684\u8bf7\u6c42\u3002\u5982\u679c\u6240\u8bf7\u6c42\u7684\u8d44\u6e90\u5728\u6307\u5b9a\u7684\u65f6\u95f4\u4e4b\u540e\u53d1\u751f\u4e86\u4fee\u6539\uff0c\u90a3\u4e48\u4f1a\u8fd4\u56de412(Precondition Failed)\u9519\u8bef\u3002
http.request.header.origin=Origin\u8bf7\u6c42\u5934\u6307\u5b9a\u4e86\u8bf7\u6c42\u6765\u81ea\u4e8e\u54ea\u4e2a\u7ad9\u70b9\u3002\u8be5\u5b57\u6bb5\u4ec5\u6307\u793a\u670d\u52a1\u5668\u540d\u79f0\uff0c\u5e76\u4e0d\u5305\u542b\u4efb\u4f55\u8def\u5f84\u4fe1\u606f\u3002\u8be5\u9996\u90e8\u7528\u4e8eCORS\u8bf7\u6c42\u6216\u8005POST\u8bf7\u6c42\u3002\u9664\u4e86\u4e0d\u5305\u542b\u8def\u5f84\u4fe1\u606f\uff0c\u8be5\u5b57\u6bb5\u4e0eReferer\u9996\u90e8\u5b57\u6bb5\u76f8\u4f3c\u3002
http.request.header.proxy-authorization=Proxy-Authorization\u662f\u4e00\u4e2a\u8bf7\u6c42\u5934\uff0c\u5176\u4e2d\u5305\u542b\u4e86\u7528\u6237\u4ee3\u7406\u63d0\u4f9b\u7ed9\u4ee3\u7406\u670d\u52a1\u5668\u7684\u7528\u4e8e\u8eab\u4efd\u9a8c\u8bc1\u7684\u51ed\u8bc1\u3002\u8fd9\u4e2a\u5934\u901a\u5e38\u662f\u5728\u670d\u52a1\u5668\u8fd4\u56de\u4e86"407 Proxy Authentication Required"\u54cd\u5e94\u72b6\u6001\u7801\u53ca"Proxy-Authenticate"\u9996\u90e8\u540e\u53d1\u9001\u7684\u3002
http.request.header.range=Range\u662f\u4e00\u4e2a\u8bf7\u6c42\u5934\uff0c\u544a\u77e5\u670d\u52a1\u5668\u8fd4\u56de\u6587\u4ef6\u7684\u54ea\u4e00\u90e8\u5206\u3002\u5728\u4e00\u4e2aRange\u8bf7\u6c42\u5934\u4e2d\uff0c\u53ef\u4ee5\u4e00\u6b21\u6027\u8bf7\u6c42\u591a\u4e2a\u90e8\u5206\uff0c\u670d\u52a1\u5668\u4f1a\u4ee5multipart\u6587\u4ef6\u7684\u5f62\u5f0f\u5c06\u5176\u8fd4\u56de\u3002\u5982\u679c\u670d\u52a1\u5668\u8fd4\u56de\u7684\u662f\u8303\u56f4\u54cd\u5e94\uff0c\u9700\u8981\u4f7f\u7528"206 Partial Content"\u72b6\u6001\u7801\u3002\u5047\u5982\u6240\u8bf7\u6c42\u7684\u8303\u56f4\u4e0d\u5408\u6cd5\uff0c\u90a3\u4e48\u670d\u52a1\u5668\u4f1a\u8fd4\u56de  416 Range Not Satisfiable \u72b6\u6001\u7801\uff0c\u8868\u793a\u5ba2\u6237\u7aef\u9519\u8bef\u3002\u670d\u52a1\u5668\u5141\u8bb8\u5ffd\u7565  Range  \u9996\u90e8\uff0c\u4ece\u800c\u8fd4\u56de\u6574\u4e2a\u6587\u4ef6\uff0c\u72b6\u6001\u7801\u7528 200 \u3002
http.request.header.referer=Referer\u8bf7\u6c42\u5934\u5305\u542b\u4e86\u5f53\u524d\u9875\u9762\u7684\u6765\u6e90\u9875\u9762\u7684\u5730\u5740\uff0c\u5f53\u524d\u9875\u9762\u662f\u901a\u8fc7\u6b64\u9875\u9762\u91cc\u7684\u94fe\u63a5\u800c\u8fdb\u5165\u7684\u3002Referer\u5141\u8bb8\u670d\u52a1\u5668\u7aef\u8bc6\u522b\u662f\u4ece\u54ea\u91cc\u8bbf\u95ee\u5230\u5b83\u4eec\u7684\uff0c\u53ef\u80fd\u4f1a\u7528\u6b64\u6570\u636e\u6765\u8fdb\u884c\u7edf\u8ba1\u5206\u6790\u3001\u8bb0\u5f55\u65e5\u5fd7\u4ee5\u53ca\u4f18\u5316\u7f13\u5b58\u7b56\u7565\u7b49\u7b49\u3002
http.request.header.te=TE\u8bf7\u6c42\u5934\u7528\u6765\u6307\u5b9a\u7528\u6237\u4ee3\u7406\u5e0c\u671b\u4f7f\u7528\u7684\u4f20\u8f93\u7f16\u7801\u7c7b\u578b\u3002\u53ef\u4ee5\u5c06\u5176\u975e\u6b63\u5f0f\u79f0\u4e3a Accept-Transfer-Encoding\uff0c\u8fd9\u4e2a\u540d\u79f0\u663e\u5f97\u66f4\u76f4\u89c2\u4e00\u4e9b\u3002
http.request.header.upgrade-insecure-requests=Upgrade-Insecure-Requests\u662f\u4e00\u4e2a\u8bf7\u6c42\u6709\uff0c\u7528\u6765\u5411\u670d\u52a1\u5668\u7aef\u53d1\u9001\u4fe1\u53f7\uff0c\u8868\u793a\u5ba2\u6237\u7aef\u4f18\u5148\u9009\u62e9\u52a0\u5bc6\u53ca\u5e26\u6709\u8eab\u4efd\u9a8c\u8bc1\u7684\u54cd\u5e94\uff0c\u5e76\u4e14\u5b83\u53ef\u4ee5\u6210\u529f\u5904\u7406"upgrade-insecure-requests CSP"\u6307\u4ee4\u3002
http.request.header.user-agent=User-Agent\u8bf7\u6c42\u5934\u5305\u542b\u4e86\u4e00\u4e2a\u7279\u5f81\u5b57\u7b26\u4e32\uff0c\u7528\u6765\u8ba9\u7f51\u7edc\u534f\u8bae\u7684\u5bf9\u7aef\u6765\u8bc6\u522b\u53d1\u8d77\u8bf7\u6c42\u7684\u7528\u6237\u4ee3\u7406\u8f6f\u4ef6\u7684\u5e94\u7528\u7c7b\u578b\u3001\u64cd\u4f5c\u7cfb\u7edf\u3001\u8f6f\u4ef6\u5f00\u53d1\u5546\u4ee5\u53ca\u7248\u672c\u53f7\u3002
http.request.header.x-forwarded-for=X-Forwarded-For(XFF)\u5728\u5ba2\u6237\u7aef\u8bbf\u95ee\u670d\u52a1\u5668\u7684\u8fc7\u7a0b\u4e2d\u5982\u679c\u9700\u8981\u7ecf\u8fc7HTTP\u4ee3\u7406\u6216\u8005\u8d1f\u8f7d\u5747\u8861\u670d\u52a1\u5668\uff0c\u53ef\u4ee5\u88ab\u7528\u6765\u83b7\u53d6\u6700\u521d\u53d1\u8d77\u8bf7\u6c42\u7684\u5ba2\u6237\u7aef\u7684IP\u5730\u5740\uff0c\u8fd9\u4e2a\u6d88\u606f\u5934\u6210\u4e3a\u4e8b\u5b9e\u4e0a\u7684\u6807\u51c6\u3002
http.request.header.x-forwarded-host=X-Forwarded-Host(XFH)\u662f\u4e00\u4e2a\u4e8b\u5b9e\u4e0a\u7684\u6807\u51c6\u5934\uff0c\u7528\u6765\u786e\u5b9a\u5ba2\u6237\u7aef\u53d1\u8d77\u7684\u8bf7\u6c42\u4e2d\u4f7f\u7528Host\u6307\u5b9a\u7684\u521d\u59cb\u57df\u540d\u3002
http.request.header.x-forwarded-proto=X-Forwarded-Proto(XFP)\u662f\u4e00\u4e2a\u4e8b\u5b9e\u4e0a\u7684\u6807\u51c6\u5934\uff0c\u7528\u6765\u786e\u5b9a\u5ba2\u6237\u7aef\u4e0e\u4ee3\u7406\u670d\u52a1\u5668\u6216\u8005\u8d1f\u8f7d\u5747\u8861\u670d\u52a1\u5668\u4e4b\u95f4\u7684\u8fde\u63a5\u6240\u91c7\u7528\u7684\u4f20\u8f93\u534f\u8bae\uff08HTTP\u6216HTTPS\uff09\u3002
