http.entity.header.allow=Allow\u5934\u90e8\u5b57\u6bb5\u7528\u4e8e\u679a\u4e3e\u8d44\u6e90\u6240\u652f\u6301\u7684 HTTP\u65b9\u6cd5\u7684\u96c6\u5408\u3002\u4f8b\u5982\uff1aAllow: GET, POST, HEAD
http.general.header.cache-control=Cache-Control\u901a\u7528\u6d88\u606f\u5934\u88ab\u7528\u4e8e\u5728HTTP\u8bf7\u6c42\u548c\u54cd\u5e94\u4e2d\uff0c\u901a\u8fc7\u6b64\u6307\u4ee4\u6765\u5b9e\u73b0\u7f13\u5b58\u673a\u5236\u3002\u7f13\u5b58\u6307\u4ee4\u662f\u5355\u5411\u7684, \u8fd9\u610f\u5473\u7740\u5728\u54cd\u5e94\u91cc\u8bbe\u7f6e\u7684\u6307\u4ee4\uff0c\u5728\u8bf7\u6c42\u4e2d\u4e0d\u7528\u5305\u542b\u76f8\u540c\u7684\u6307\u4ee4\u3002
http.general.header.connection=Connection\u901a\u7528\u6d88\u606f\u5934\u51b3\u5b9a\u5f53\u524d\u7684\u4e8b\u52a1\u5b8c\u6210\u540e\uff0c\u662f\u5426\u4f1a\u5173\u95ed\u7f51\u7edc\u8fde\u63a5\u3002\u5982\u679c\u8be5\u503c\u662f"keep-alive"\uff0c\u7f51\u7edc\u8fde\u63a5\u5c31\u662f\u6301\u4e45\u7684\uff0c\u4e0d\u4f1a\u5173\u95ed\uff0c\u4f7f\u5f97\u5bf9\u540c\u4e00\u4e2a\u670d\u52a1\u5668\u7684\u8bf7\u6c42\u53ef\u4ee5\u7ee7\u7eed\u5728\u8be5\u8fde\u63a5\u4e0a\u5b8c\u6210\u3002
http.entity.header.content-encoding=Content-Encoding\u662f\u4e00\u4e2a\u5b9e\u4f53\u6d88\u606f\u5934\uff0c\u7528\u4e8e\u5bf9\u7279\u5b9a\u5a92\u4f53\u7c7b\u578b\u7684\u6570\u636e\u8fdb\u884c\u538b\u7f29\u3002\u5f53\u8fd9\u4e2a\u6d88\u606f\u5934\u51fa\u73b0\u7684\u65f6\u5019\uff0c\u5b83\u7684\u503c\u8868\u793a\u6d88\u606f\u4e3b\u4f53\u8fdb\u884c\u4e86\u4f55\u79cd\u65b9\u5f0f\u7684\u5185\u5bb9\u7f16\u7801\u8f6c\u6362\u3002\u8fd9\u4e2a\u6d88\u606f\u5934\u7528\u6765\u544a\u77e5\u5ba2\u6237\u7aef\u5e94\u8be5\u600e\u6837\u89e3\u7801\u624d\u80fd\u83b7\u53d6\u5728Content-Type\u4e2d\u8bbe\u7f6e\u7684\u5a92\u4f53\u7c7b\u578b\u5185\u5bb9\u3002
http.general.header.content-disposition=\u5728\u5e38\u89c4\u7684HTTP\u5e94\u7b54\u4e2d\uff0cContent-Disposition\u6d88\u606f\u5934\u6307\u793a\u56de\u590d\u7684\u5185\u5bb9\u8be5\u4ee5\u4f55\u79cd\u5f62\u5f0f\u5c55\u793a\uff0c\u662f\u4ee5\u5185\u8054\u7684\u5f62\u5f0f\uff08\u5373\u7f51\u9875\u6216\u8005\u9875\u9762\u7684\u4e00\u90e8\u5206\uff0c\u8fd8\u662f\u4ee5\u9644\u4ef6\u7684\u5f62\u5f0f\u4e0b\u8f7d\u5e76\u4fdd\u5b58\u5230\u672c\u5730\u3002\u5728multipart/form-data\u7c7b\u578b\u7684\u5e94\u7b54\u6d88\u606f\u4f53\u4e2d\uff0cContent-Disposition\u6d88\u606f\u5934\u53ef\u4ee5\u88ab\u7528\u5728multipart\u6d88\u606f\u4f53\u7684\u5b50\u90e8\u5206\u4e2d\uff0c\u7528\u6765\u7ed9\u51fa\u5176\u5bf9\u5e94\u5b57\u6bb5\u7684\u76f8\u5173\u4fe1\u606f\u3002\u5404\u4e2a\u5b50\u90e8\u5206\u7531\u5728Content-Type\u4e2d\u5b9a\u4e49\u7684\u5206\u9694\u7b26\u5206\u9694\u3002\u7528\u5728\u6d88\u606f\u4f53\u81ea\u8eab\u5219\u65e0\u5b9e\u9645\u610f\u4e49\u3002
http.entity.header.content-language=Content-Language\u662f\u4e00\u4e2a\u5b9e\u4f53\u6d88\u606f\u5934\uff0c\u7528\u6765\u8bf4\u660e\u8bbf\u95ee\u8005\u5e0c\u671b\u91c7\u7528\u7684\u8bed\u8a00\u6216\u8bed\u8a00\u7ec4\u5408\uff0c\u8fd9\u6837\u7684\u8bdd\u7528\u6237\u5c31\u53ef\u4ee5\u6839\u636e\u81ea\u5df1\u504f\u597d\u7684\u8bed\u8a00\u6765\u5b9a\u5236\u4e0d\u540c\u7684\u5185\u5bb9\u3002
http.entity.header.content-length=Content-Length\u662f\u4e00\u4e2a\u5b9e\u4f53\u6d88\u606f\u5934\uff0c\u7528\u6765\u6307\u660e\u53d1\u9001\u7ed9\u63a5\u6536\u65b9\u7684\u6d88\u606f\u4e3b\u4f53\u7684\u5927\u5c0f\uff0c\u5373\u7528\u5341\u8fdb\u5236\u6570\u5b57\u8868\u793a\u3002
http.entity.header.content-location=Content-Location\u5b9e\u4f53\u6d88\u606f\u5934\u6307\u5b9a\u7684\u662f\u8981\u8fd4\u56de\u7684\u6570\u636e\u7684\u5730\u5740\u9009\u9879\u3002\u6700\u4e3b\u8981\u7684\u7528\u9014\u662f\u7528\u6765\u6307\u5b9a\u8981\u8bbf\u95ee\u7684\u8d44\u6e90\u7ecf\u8fc7\u5185\u5bb9\u534f\u5546\u540e\u7684\u7ed3\u679c\u7684URL\u3002
http.entity.header.content-type=Content-Type\u5b9e\u4f53\u5934\u90e8\u7528\u4e8e\u6307\u793a\u8d44\u6e90\u7684MIME\u7c7b\u578b Media Type\u3002\u5728\u54cd\u5e94\u4e2d\uff0cContent-Type\u5934\u544a\u8bc9\u5ba2\u6237\u7aef\u5b9e\u9645\u8fd4\u56de\u7684\u5185\u5bb9\u7684\u5185\u5bb9\u7c7b\u578b\u3002\u6d4f\u89c8\u5668\u4f1a\u5728\u67d0\u4e9b\u60c5\u51b5\u4e0b\u8fdb\u884cMIME\u55c5\u63a2\uff0c\u5e76\u4e0d\u4e00\u5b9a\u9075\u5faa\u6b64\u6807\u9898\u7684\u503c\u3002\u4e3a\u4e86\u9632\u6b62\u8fd9\u79cd\u884c\u4e3a\uff0c\u53ef\u4ee5\u5c06\u6807\u9898 X-Content-Type-Options\u8bbe\u7f6e\u4e3anosniff\uff1b\u5728\u8bf7\u6c42\u4e2d(\u5982POST \u6216 PUT)\uff0c\u5ba2\u6237\u7aef\u544a\u8bc9\u670d\u52a1\u5668\u5b9e\u9645\u53d1\u9001\u7684\u6570\u636e\u7c7b\u578b\u3002
http.general.header.date=Date\u662f\u4e00\u4e2a\u901a\u7528\u6d88\u606f\u5934\uff0c\u5176\u4e2d\u5305\u542b\u4e86\u6d88\u606f\u751f\u6210\u7684\u65e5\u671f\u548c\u65f6\u95f4\u3002
http.general.header.keep-alive=Keep-Alive\u662f\u4e00\u4e2a\u901a\u7528\u6d88\u606f\u5934\uff0c\u5141\u8bb8\u6d88\u606f\u53d1\u9001\u8005\u8bbe\u7f6e\u8fde\u63a5\u72b6\u6001\u3001\u8d85\u65f6\u65f6\u957f\u548c\u6700\u5927\u8bf7\u6c42\u6570\u3002
http.general.header.pragma=Pragma\u662f\u4e00\u4e2a\u5728 HTTP/1.0\u4e2d\u89c4\u5b9a\u7684\u901a\u7528\u9996\u90e8\uff0c\u8fd9\u4e2a\u9996\u90e8\u7684\u6548\u679c\u4f9d\u8d56\u4e8e\u4e0d\u540c\u7684\u5b9e\u73b0\uff0c\u6240\u4ee5\u5728"\u8bf7\u6c42-\u54cd\u5e94"\u94fe\u4e2d\u53ef\u80fd\u4f1a\u6709\u4e0d\u540c\u7684\u6548\u679c\u3002\u5b83\u7528\u6765\u5411\u540e\u517c\u5bb9\u53ea\u652f\u6301 HTTP/1.0\u534f\u8bae\u7684\u7f13\u5b58\u670d\u52a1\u5668\uff0c\u90a3\u65f6\u5019 HTTP/1.1\u534f\u8bae\u4e2d\u7684Cache-Control\u8fd8\u6ca1\u6709\u51fa\u6765\u3002
http.general.header.via=Via\u662f\u4e00\u4e2a\u901a\u7528\u6d88\u606f\u5934\uff0c\u662f\u7531\u4ee3\u7406\u670d\u52a1\u5668\u6dfb\u52a0\u7684\uff0c\u9002\u7528\u4e8e\u6b63\u5411\u548c\u53cd\u5411\u4ee3\u7406\uff0c\u5728\u8bf7\u6c42\u548c\u54cd\u5e94\u9996\u90e8\u4e2d\u5747\u53ef\u51fa\u73b0\u3002\u8fd9\u4e2a\u6d88\u606f\u9996\u90e8\u53ef\u4ee5\u7528\u6765\u8ffd\u8e2a\u6d88\u606f\u8f6c\u53d1\u60c5\u51b5\uff0c\u9632\u6b62\u5faa\u73af\u8bf7\u6c42\uff0c\u4ee5\u53ca\u8bc6\u522b\u5728\u8bf7\u6c42\u6216\u54cd\u5e94\u4f20\u9012\u94fe\u4e2d\u6d88\u606f\u53d1\u9001\u8005\u5bf9\u4e8e\u534f\u8bae\u7684\u652f\u6301\u80fd\u529b\u3002
http.general.header.warning=Warning\u662f\u4e00\u4e2a\u901a\u7528\u6d88\u606f\u5934\uff0c\u5305\u542b\u6709\u5f53\u524d\u6d88\u606f\u72b6\u6001\u53ef\u80fd\u5b58\u5728\u7684\u95ee\u9898\u3002\u5728\u54cd\u5e94\u4e2d\u53ef\u4ee5\u51fa\u73b0\u591a\u4e2aWarning\u9996\u90e8\u3002
