http.response.header.accept-ranges=Accept-Range\u54cd\u5e94\u5934\u6807\u8bc6\u670d\u52a1\u5668\u81ea\u8eab\u652f\u6301\u7684\u5206\u533a\u8bf7\u6c42\u3002\u5b57\u6bb5\u503c\u7528\u4e8e\u5b9a\u4e49\u5206\u533a\u8bf7\u6c42\u7684\u5355\u4f4d\u3002\u4f8b\u5982:Accept-Ranges: bytes\uff0c\u5e38\u7528\u4e8e\u65ad\u70b9\u7eed\u4f20\u7684\u5e94\u7528\u4e2d\u3002
http.response.header.access-control-allow-credentials=Access-Control-Allow-Credentials\u54cd\u5e94\u5934\u8868\u793a\u662f\u5426\u53ef\u4ee5\u5c06\u5bf9\u8bf7\u6c42\u7684\u54cd\u5e94\u66b4\u9732\u7ed9\u9875\u9762\u3002\u8fd4\u56detrue\u5219\u53ef\u4ee5\uff0c\u5176\u4ed6\u503c\u5747\u4e0d\u53ef\u4ee5\u3002
http.response.header.access-control-allow-headers=Access-Control-Allow-Headers\u54cd\u5e94\u5934\u7528\u4e8ePreflight Request\uff08\u9884\u68c0\u8bf7\u6c42\uff09\u4e2d\uff0c\u5217\u51fa\u4e86\u5c06\u4f1a\u5728\u6b63\u5f0f\u8bf7\u6c42\u7684Access-Control-Expose-Headers\u5b57\u6bb5\u4e2d\u51fa\u73b0\u7684\u5934\u4fe1\u606f\u3002
http.response.header.access-control-allow-methods=Access-Control-Allow-Methods\u54cd\u5e94\u5934\u5728\u5bf9Preflight Request\uff08\u9884\u68c0\u8bf7\u6c42\uff09\u7684\u5e94\u7b54\u4e2d\u660e\u786e\u4e86\u5ba2\u6237\u7aef\u6240\u8981\u8bbf\u95ee\u7684\u8d44\u6e90\u5141\u8bb8\u4f7f\u7528\u7684\u65b9\u6cd5\u6216\u65b9\u6cd5\u5217\u8868\u3002\u4f8b\u5982\uff1aAccess-Control-Allow-Methods: POST, GET, OPTIONS\uff0c\u5e38\u7528\u4e8e\u8de8\u57df\u8bf7\u6c42\u7684\u5e94\u7528\u4e2d\u3002
http.response.header.access-control-allow-origin=Access-Control-Allow-Origin\u54cd\u5e94\u5934\u6307\u5b9a\u4e86\u8be5\u54cd\u5e94\u7684\u8d44\u6e90\u662f\u5426\u88ab\u5141\u8bb8\u4e0e\u6307\u5b9a\u7684\u57df\u5171\u4eab\u3002\u4f8b\u5982\uff1aAccess-Control-Allow-Origin: *\u6216Access-Control-Allow-Origin: https://developer.mozilla.org\uff0c\u5e38\u7528\u4e8e\u8de8\u57df\u8bf7\u6c42\u7684\u5e94\u7528\u4e2d\u3002
http.response.header.access-control-expose-headers=Access-Control-Expose-Headers\u5217\u51fa\u4e86\u54ea\u4e9b\u5934\u90e8\u53ef\u4ee5\u4f5c\u4e3a\u54cd\u5e94\u7684\u4e00\u90e8\u5206\u66b4\u9732\u7ed9\u5916\u90e8\u3002\u9ed8\u8ba4\u60c5\u51b5\u4e0b\uff0c\u53ea\u6709\u516d\u79cd\uff1a1.Cache-Control;2.Content-Language;3.Content-Type;4.Expires;5.Last-Modified;6.Pragma\uff0c\u5e38\u7528\u4e8e\u8de8\u57df\u8bf7\u6c42\u7684\u5e94\u7528\u4e2d\u3002
http.response.header.access-control-max-age=Access-Control-Max-Age\u54cd\u5e94\u5934\u8868\u793aPreflight Request\uff08\u9884\u68c0\u8bf7\u6c42\uff09\u7684\u8fd4\u56de\u7ed3\u679c\uff08\u5373 Access-Control-Allow-Methods \u548cAccess-Control-Allow-Headers \u63d0\u4f9b\u7684\u4fe1\u606f\uff09\u53ef\u4ee5\u88ab\u7f13\u5b58\u591a\u4e45\uff0c\u5355\u4f4d\u662f\u79d2\u3002
http.response.header.age=Age\u54cd\u5e94\u5934\u91cc\u5305\u542b\u6d88\u606f\u5bf9\u8c61\u5728\u7f13\u5b58\u4ee3\u7406\u4e2d\u5b58\u50a8\u7684\u65f6\u957f\uff0c\u4ee5\u79d2\u4e3a\u5355\u4f4d\u3002
http.response.header.content-security-policy=Content-Security-Policy\u54cd\u5e94\u5934\u5141\u8bb8\u7ad9\u70b9\u7ba1\u7406\u8005\u5728\u6307\u5b9a\u7684\u9875\u9762\u63a7\u5236\u7528\u6237\u4ee3\u7406\u7684\u8d44\u6e90\u3002\u9664\u4e86\u5c11\u6570\u4f8b\u5916\uff0c\u8fd9\u6761\u7b56\u7565\u5c06\u6781\u5927\u5730\u6307\u5b9a\u670d\u52a1\u6e90\u4ee5\u53ca\u811a\u672c\u7aef\u70b9\u3002\u8fd9\u5c06\u5e2e\u52a9\u9632\u6b62\u8de8\u7ad9\u811a\u672c\u653b\u51fb\uff08Cross-Site Script XSS\uff09\u3002
http.response.header.content-security-policy-report-only=Content-Security-Policy-Report-Only\u54cd\u5e94\u5934\u5141\u8bb8web\u5f00\u53d1\u4eba\u5458\u901a\u8fc7\u76d1\u6d4b(\u4f46\u4e0d\u5f3a\u5236\u6267\u884c)\u7b56\u7565\u7684\u5f71\u54cd\u6765\u5c1d\u8bd5\u7b56\u7565\u3002\u8fd9\u4e9b\u8fdd\u53cd\u62a5\u544a\u7531JSON\u6587\u6863\u7ec4\u6210\u901a\u8fc7\u4e00\u4e2aHTTP POST\u8bf7\u6c42\u53d1\u9001\u5230\u6307\u5b9a\u7684URI\u3002
http.response.header.content-range=Content-Range\u54cd\u5e94\u5934\u663e\u793a\u7684\u662f\u4e00\u4e2a\u6570\u636e\u7247\u6bb5\u5728\u6574\u4e2a\u6587\u4ef6\u4e2d\u7684\u4f4d\u7f6e\u3002
http.response.header.etag=ETag HTTP\u54cd\u5e94\u5934\u662f\u8d44\u6e90\u7684\u7279\u5b9a\u7248\u672c\u7684\u6807\u8bc6\u7b26\u3002\u8fd9\u53ef\u4ee5\u8ba9\u7f13\u5b58\u66f4\u9ad8\u6548\uff0c\u5e76\u8282\u7701\u5e26\u5bbd\uff0c\u56e0\u4e3a\u5982\u679c\u5185\u5bb9\u6ca1\u6709\u6539\u53d8\uff0cWeb\u670d\u52a1\u5668\u4e0d\u9700\u8981\u53d1\u9001\u5b8c\u6574\u7684\u54cd\u5e94\u3002\u800c\u5982\u679c\u5185\u5bb9\u53d1\u751f\u4e86\u53d8\u5316\uff0c\u4f7f\u7528ETag\u6709\u52a9\u4e8e\u9632\u6b62\u8d44\u6e90\u7684\u540c\u65f6\u66f4\u65b0\u76f8\u4e92\u8986\u76d6\u3002
http.response.header.expires=Expires\u54cd\u5e94\u5934\u6307\u5b9a\u4e86\u4e00\u4e2a\u65e5\u671f/\u65f6\u95f4\uff0c\u5728\u8fd9\u4e2a\u65e5\u671f/\u65f6\u95f4\u4e4b\u540e\uff0cHTTP\u54cd\u5e94\u88ab\u8ba4\u4e3a\u662f\u8fc7\u65f6\u7684\u3002\u65e0\u6548\u7684\u65e5\u671f\uff0c\u6bd4\u59820\uff0c\u4ee3\u8868\u7740\u4e00\u4e2a\u8fc7\u53bb\u7684\u4e8b\u4ef6\uff0c\u5373\u8be5\u8d44\u6e90\u5df2\u7ecf\u8fc7\u671f\u4e86\u3002\u5982\u679c\u8fd8\u6709\u4e00\u4e2a \u8bbe\u7f6e\u4e86"max-age"\u6216\u8005"s-max-age"\u6307\u4ee4\u7684Cache-Control\u54cd\u5e94\u5934\uff0c\u90a3\u4e48Expires\u5934\u5c31\u4f1a\u88ab\u5ffd\u7565\u3002
http.response.header.last-modified=Last-Modified\u662f\u4e00\u4e2a\u54cd\u5e94\u5934\uff0c\u5176\u4e2d\u5305\u542b\u6e90\u670d\u52a1\u5668\u8ba4\u5b9a\u7684\u8d44\u6e90\u505a\u51fa\u4fee\u6539\u7684\u65e5\u671f\u53ca\u65f6\u95f4\u3002\u5b83\u901a\u5e38\u88ab\u7528\u4f5c\u4e00\u4e2a\u9a8c\u8bc1\u5668\u6765\u5224\u65ad\u63a5\u6536\u5230\u7684\u6216\u8005\u5b58\u50a8\u7684\u8d44\u6e90\u662f\u5426\u5f7c\u6b64\u4e00\u81f4\u3002\u7531\u4e8e\u7cbe\u786e\u5ea6\u6bd4ETag\u8981\u4f4e\uff0c\u6240\u4ee5\u8fd9\u662f\u4e00\u4e2a\u5907\u7528\u673a\u5236\u3002\u5305\u542b\u6709If-Modified-Since\u6216If-Unmodified-Since\u9996\u90e8\u7684\u6761\u4ef6\u8bf7\u6c42\u4f1a\u4f7f\u7528\u8fd9\u4e2a\u5b57\u6bb5\u3002
http.response.header.location=Location\u54cd\u5e94\u5934\u6307\u5b9a\u7684\u662f\u9700\u8981\u5c06\u9875\u9762\u91cd\u5b9a\u5411\u7684\u5730\u5740\u3002\u4e00\u822c\u5728\u54cd\u5e94\u7801\u4e3a3xx\u7684\u54cd\u5e94\u4e2d\u624d\u4f1a\u6709\u610f\u4e49\u3002
http.response.header.proxy-authenticate=Proxy-Authenticate\u662f\u4e00\u4e2a\u54cd\u5e94\u9996\u90e8\uff0c\u6307\u5b9a\u4e86\u83b7\u53d6\u4ee3\u7406\u670d\u52a1\u5668\u4e0a\u7684\u8d44\u6e90\u8bbf\u95ee\u6743\u9650\u800c\u91c7\u7528\u7684\u8eab\u4efd\u9a8c\u8bc1\u65b9\u5f0f\u3002\u4ee3\u7406\u670d\u52a1\u5668\u5bf9\u8bf7\u6c42\u8fdb\u884c\u9a8c\u8bc1\uff0c\u4ee5\u4fbf\u5b83\u8fdb\u4e00\u6b65\u4f20\u9012\u8bf7\u6c42\u3002
http.response.header.retry-after=Retry-After\u54cd\u5e94\u5934\u8868\u793a\u7528\u6237\u4ee3\u7406\u9700\u8981\u7b49\u5f85\u591a\u957f\u65f6\u95f4\u4e4b\u540e\u624d\u80fd\u7ee7\u7eed\u53d1\u9001\u8bf7\u6c42\u3002\u8fd9\u4e2a\u9996\u90e8\u4e3b\u8981\u5e94\u7528\u4e8e\u4ee5\u4e0b\u4e24\u79cd\u573a\u666f\uff1a1.\u5f53\u4e0e 503(Service Unavailable\uff0c\u5f53\u524d\u670d\u52a1\u4e0d\u5b58\u5728)\u54cd\u5e94\u4e00\u8d77\u53d1\u9001\u7684\u65f6\u5019\uff0c\u8868\u793a\u670d\u52a1\u4e0b\u7ebf\u7684\u9884\u671f\u65f6\u957f\uff1b2.\u5f53\u4e0e\u91cd\u5b9a\u5411\u54cd\u5e94\u4e00\u8d77\u53d1\u9001\u7684\u65f6\u5019\uff0c\u6bd4\u5982"301(Moved Permanently\uff0c\u6c38\u4e45\u8fc1\u79fb)"\uff0c\u8868\u793a\u7528\u6237\u4ee3\u7406\u5728\u53d1\u9001\u91cd\u5b9a\u5411\u8bf7\u6c42\u4e4b\u524d\u9700\u8981\u7b49\u5f85\u7684\u6700\u77ed\u65f6\u95f4\u3002
http.response.header.server=Server\u54cd\u5e94\u5934\u5305\u542b\u4e86\u5904\u7406\u8bf7\u6c42\u7684\u6e90\u670d\u52a1\u5668\u6240\u7528\u5230\u7684\u8f6f\u4ef6\u76f8\u5173\u4fe1\u606f\u3002
http.response.header.set-cookie=Set-Cookie\u54cd\u5e94\u5934\u88ab\u7528\u6765\u7531\u670d\u52a1\u5668\u7aef\u5411\u5ba2\u6237\u7aef\u53d1\u9001cookie\u3002
http.response.header.set-cookie2=Set-Cookie2\u662f\u4e00\u4e2a\u54cd\u5e94\u5934\uff0c\u5df2\u5e9f\u5f03\u4f7f\u7528\u3002\u5b83\u88ab\u670d\u52a1\u5668\u7528\u6765\u5411\u5ba2\u6237\u7aef\u53d1\u9001cookie\u6570\u636e\uff0c\u4f46\u662f\u5df2\u7ecf\u5728\u534f\u8bae\u4e2d\u88ab\u6807\u8bb0\u4e3a\u4e0d\u8d5e\u6210\u4f7f\u7528\u4e86\u3002\u8bf7\u4f7f\u7528Set-Cookie\u5c06\u5176\u4ee3\u66ff\u3002
http.response.header.trailer=Trailer\u662f\u4e00\u4e2a\u54cd\u5e94\u5934\uff0c\u5141\u8bb8\u53d1\u9001\u65b9\u5728\u5206\u5757\u53d1\u9001\u7684\u6d88\u606f\u540e\u9762\u6dfb\u52a0\u989d\u5916\u7684\u5143\u4fe1\u606f\uff0c\u8fd9\u4e9b\u5143\u4fe1\u606f\u662f\u968f\u7740\u6d88\u606f\u4e3b\u4f53\u7684\u53d1\u9001\u52a8\u6001\u751f\u6210\u7684\uff0c\u6bd4\u5982\u6d88\u606f\u5b8c\u6574\u6027\u6821\u9a8c\uff0c\u6570\u5b57\u7b7e\u540d\uff0c\u6216\u8005\u540e\u5904\u7406\u72b6\u6001\u7b49\u3002
http.response.header.transfer-encoding=Transfer-Encoding\u54cd\u5e94\u6307\u660e\u4e86\u5c06entity\u5b89\u5168\u4f20\u9012\u7ed9\u7528\u6237\u6240\u91c7\u7528\u7684\u7f16\u7801\u5f62\u5f0f\u3002
http.response.header.vary=Vary\u54cd\u5e94\u5934\u51b3\u5b9a\u4e86\u5bf9\u4e8e\u672a\u6765\u7684\u4e00\u4e2a\u8bf7\u6c42\u5934\u5e94\u8be5\u7528\u4e00\u4e2a\u7f13\u5b58\u7684\u56de\u590d\u8fd8\u662f\u5411\u6e90\u670d\u52a1\u5668\u8bf7\u6c42\u4e00\u4e2a\u65b0\u7684\u56de\u590d\u3002\u5b83\u88ab\u670d\u52a1\u5668\u7528\u6765\u8868\u660e\u5728"Content Negotiation Algorithm\uff08\u5185\u5bb9\u534f\u5546\u7b97\u6cd5\uff09"\u4e2d\u9009\u62e9\u4e00\u4e2a\u8d44\u6e90\u4ee3\u8868\u7684\u65f6\u5019\u5e94\u8be5\u4f7f\u7528\u54ea\u4e9b\u5934\u90e8\u4fe1\u606f\u3002
http.response.header.www-authenticate=WWW-Authenticate\u54cd\u5e94\u5934\u5b9a\u4e49\u4e86\u4f7f\u7528\u4f55\u79cd\u9a8c\u8bc1\u65b9\u5f0f\u53bb\u83b7\u53d6\u5bf9\u8d44\u6e90\u7684\u8fde\u63a5\u3002WWW-Authenticate\u5934\u901a\u5e38\u4f1a\u548c\u4e00\u4e2a"401 Unauthorized"\u7684\u54cd\u5e94\u4e00\u540c\u88ab\u53d1\u9001\u3002
